[Demo_Shinobu_ep3_1 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_ep3_1.GG2_V_Shinobu_ep3_1_001_Cue',Name="エコロ")
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[13]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[14]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[15]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[16]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=0,Number=1,Bit=0)
DemoScripts[17]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_ep3_1.GG2_V_Shinobu_ep3_1_003_Cue',Name="エコロ")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[19]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[21]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_lp_close_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0102_fx_Stand2Displease",Rate=0,Number=3,Bit=1)
DemoScripts[22]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0200_lp_Displease",Number=8)
DemoScripts[23]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Shinobu_ep3_1.GG2_V_Shinobu_ep3_1_005_Cue',Name="エコロ")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[25]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[27]=(Actor=WINDOW,Command=EXIT)
DemoScripts[28]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[29]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[30]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[31]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[32]=(Actor=SYSTEM,Command=END)

[Select_Shinobu_ep3_1 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Shinobu_ep3_1 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="艾可蘿",Text="那麼,為了打倒忍大人的守護者,/n就繼續讓女孩子昇天,/n提升受歡迎氣場吧.")

Texts[1]=(Label="TEXT02",Name="峯大",Text="......畢竟也不能放著/n被惡魔操控的女孩子不管嘛.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="的確是這樣沒錯,/n可是那聽起來有點像是藉口呢.")

Texts[3]=(Label="TEXT04",Name="峯大",Text="唔......不過,到頭來還是為了自己,/n所以我也沒什麼好反駁的啦.")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="很好./n有這種程度的自覺就完美了./n那麼,我們走吧.")

Texts[5]=(Label="TEXT06",Name="峯大",Text="(這個人為什麼會一副了不起的樣子啊......)")

Texts[6]=(Label="",Name="",Text="")

Texts[7]=(Label="SELECT01",Name="",Text="")

Texts[8]=(Label="SELECT02",Name="",Text="")

Texts[9]=(Label="SELECT03",Name="",Text="")

Texts[10]=(Label="SELECT04",Name="",Text="")

Texts[11]=(Label="SELECT05",Name="",Text="")

Texts[12]=(Label="SELECT06",Name="",Text="")

Texts[13]=(Label="SELECT07",Name="",Text="")

Texts[14]=(Label="SELECT08",Name="",Text="")

Texts[15]=(Label="SELECT09",Name="",Text="")

Texts[16]=(Label="SELECT10",Name="",Text="")


